01Hub/fbedit/STM32F4Discovery/STN32F4_GTVTerminal/main.c
/*******************************************************************************
* File Name          : main.c
* Author             : KetilO
* Version            : V1.0.0
* Date               : 14/08/2012
* Description        : Main program body
*******************************************************************************/

/*******************************************************************************
* Port pins used
*
* Video out
* PA1   H-Sync and V-Sync
* PB15  Video out SPI2_MOSI
* RS232
* PA2   USART2 Tx
* PA3   USART2 Rx
* Keyboard
* PB0   Keyboard clock in
* PB1   Keyboard data in
* Mouse
* PB2   Mouse clock in
* PB3   Mouse data in
* Leds
* PA9   Green
* PD5   Red
* PD12  Green
* PD13  Orange
* PD14  Red
* PD15  Blue
* User button
* PA0   User button
*******************************************************************************/

/*******************************************************************************
* Video output
*                  330
* PB15    O-------[  ]---o---------O  Video output
*                  1k0   |
* PA1     O-------[  ]---o
*                        |
*                       ---
*                       | |  82
*                       ---
*                        |
* GND     O--------------o---------O  GND
* 
*******************************************************************************/

/* Includes ------------------------------------------------------------------*/
#include "stm32f4_discovery.h"
#include "video.h"

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define SHIELD_TOP      200

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
extern volatile uint16_t FrameCount;

extern uint8_t rs232buf[256];
extern uint8_t rs232buftail;
extern uint8_t rs232bufhead;

extern uint8_t charbuf[256];
extern uint8_t charbuftail;
extern uint8_t charbufhead;

volatile int8_t Shooters;       // Number of spare shooters
volatile uint8_t Shots;         // Number of active shots
volatile uint8_t Bombs;         // Number of active bombs
volatile GameOver;              // Game over flag

RECT AlienBound;
extern SPRITE* Sprites[];
SPRITE Alien[32];
SPRITE Shooter;
SPRITE Bomb[8];
SPRITE Shot[4];
extern SPRITE Cursor;
ICON Shield;
volatile uint32_t RNDSeed;

uint8_t Alien1Icon[16][16] = {
{2,2,1,1,1,1,1,1,1,1,1,1,1,1,2,2},
{2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,2},
{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
{1,1,1,1,0,1,1,1,1,1,1,0,1,1,1,1},
{1,1,1,0,0,0,1,1,1,1,0,0,0,1,1,1},
{1,1,1,1,0,1,1,1,1,1,1,0,1,1,1,1},
{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
{1,1,1,1,1,1,1,0,0,1,1,1,1,1,1,1},
{1,1,1,1,0,0,0,0,0,0,0,0,1,1,1,1},
{1,1,1,1,0,0,1,1,1,1,0,0,1,1,1,1},
{2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,2},
{2,2,2,2,1,1,2,2,2,2,1,1,2,2,2,2},
{2,2,2,1,1,2,2,2,2,2,2,1,1,2,2,2},
{2,2,1,1,2,2,2,2,2,2,2,2,1,1,2,2},
{2,1,1,2,2,2,2,2,2,2,2,2,2,1,1,2},
{1,1,1,2,2,2,2,2,2,2,2,2,2,1,1,1}
};

uint8_t Alien2Icon[16][16] = {
{2,2,1,1,1,1,1,1,1,1,1,1,1,1,2,2},
{2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,2},
{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
{1,1,1,1,0,1,1,1,1,1,1,0,1,1,1,1},
{1,1,1,0,0,0,1,1,1,1,0,0,0,1,1,1},
{1,1,1,1,0,1,1,1,1,1,1,0,1,1,1,1},
{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
{1,1,1,1,0,0,1,1,1,1,0,0,1,1,1,1},
{1,1,1,1,0,0,0,0,0,0,0,0,1,1,1,1},
{1,1,1,1,1,1,1,0,0,1,1,1,1,1,1,1},
{2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,2},
{2,2,2,2,1,1,2,2,2,2,1,1,2,2,2,2},
{2,2,2,1,1,2,2,2,2,2,2,1,1,2,2,2},
{2,2,1,1,2,2,2,2,2,2,2,2,1,1,2,2},
{2,2,1,1,2,2,2,2,2,2,2,2,1,1,2,2},
{2,2,1,1,1,1,2,2,2,2,1,1,1,1,2,2}
};

uint8_t ShooterIcon[16][20] = {
{2,2,2,2,2,2,1,1,1,1,1,1,1,1,2,2,2,2,2,2},
{2,2,2,2,2,2,1,1,1,1,1,1,1,1,2,2,2,2,2,2},
{2,2,2,2,2,2,1,1,1,1,1,1,1,1,2,2,2,2,2,2},
{2,2,2,2,2,2,1,1,1,1,1,1,1,1,2,2,2,2,2,2},
{2,2,2,2,2,2,1,1,1,1,1,1,1,1,2,2,2,2,2,2},
{2,2,2,2,2,2,1,1,1,1,1,1,1,1,2,2,2,2,2,2},
{2,2,2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,2,2,2},
{2,2,2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,2,2,2},
{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
};

uint8_t ShieldIcon[16][36] = {
{2,2,2,2,2,2,2,2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,2,2,2,2,2,2,2,2},
{2,2,2,2,2,2,2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,2,2,2,2,2,2,2},
{2,2,2,2,2,2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,2,2,2,2,2,2},
{2,2,2,2,2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,2,2,2,2,2},
{2,2,2,2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,2,2,2,2},
{2,2,2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,2,2,2},
{2,2,1,1,1,1,1,1,2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,2,1,1,1,1,1,1,2,2},
{2,1,1,1,1,1,2,2,2,2,2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,2,2,2,2,2,1,1,1,1,1,2},
{1,1,1,1,1,2,2,2,2,2,2,2,1,1,1,1,1,1,1,1,1,1,1,1,2,2,2,2,2,2,2,1,1,1,1,1},
{1,1,1,1,2,2,2,2,2,2,2,2,2,1,1,1,1,1,1,1,1,1,1,2,2,2,2,2,2,2,2,2,1,1,1,1},
{1,1,1,1,2,2,2,2,2,2,2,2,2,1,1,1,1,1,1,1,1,1,1,2,2,2,2,2,2,2,2,2,1,1,1,1},
{1,1,1,1,2,2,2,2,2,2,2,2,2,1,1,1,1,1,1,1,1,1,1,2,2,2,2,2,2,2,2,2,1,1,1,1},
{1,1,1,1,2,2,2,2,2,2,2,2,2,1,1,1,1,1,1,1,1,1,1,2,2,2,2,2,2,2,2,2,1,1,1,1},
{1,1,1,1,2,2,2,2,2,2,2,2,2,1,1,1,1,1,1,1,1,1,1,2,2,2,2,2,2,2,2,2,1,1,1,1},
{1,1,1,1,2,2,2,2,2,2,2,2,2,1,1,1,1,1,1,1,1,1,1,2,2,2,2,2,2,2,2,2,1,1,1,1},
{1,1,1,1,2,2,2,2,2,2,2,2,2,1,1,1,1,1,1,1,1,1,1,2,2,2,2,2,2,2,2,2,1,1,1,1}
};

uint8_t ShotIcon[8][3] = {
{1,1,1},
{1,1,1},
{1,1,1},
{1,1,1},
{1,1,1},
{1,1,1},
{1,1,1},
{1,1,1}
};

/* Private function prototypes -----------------------------------------------*/
void RCC_Config(void);
void NVIC_Config(void);
void GPIO_Config(void);
void TIM_Config(void);
void SPI_Config(void);
void DMA_Config(void);
void USART_Config(uint32_t Baud);
uint32_t Random(uint32_t Range);

/* Private functions ---------------------------------------------------------*/

/**
  * @brief  This function generates a random number
  * @param  None
  * @retval None
  */
uint32_t Random(uint32_t Range)
{
  uint32_t rnd;
  RNDSeed=(((RNDSeed*23+7) & 0xFFFFFFFF)>>1)^RNDSeed;
  rnd=RNDSeed-(RNDSeed/Range)*Range;
  return rnd;
}

void GameSetup(void)
{
  int16_t i;

