01Hub/fbedit/STM32F4Discovery/STN32F4_GTVTerminal/main.c
  Shots=0;
  Bombs=0;
  GameOver=0;
  Cls();
  /* Draw game frame */
  Rectangle(0,0,480,250,1);
  /* Setup alien sprites */
  AlienBound.left=10;
  AlienBound.top=26;
  AlienBound.right=469;
  AlienBound.bottom=239;
  i=0;
  /* Setup bomb sprites */
  while (i<8)
  {
    Bomb[i].icon.wt=3;
    Bomb[i].icon.ht=8;
    Bomb[i].icon.icondata=*ShotIcon;
    Bomb[i].x=0;
    Bomb[i].y=0;
    Bomb[i].visible=0;
    Bomb[i].collision=0;
    Bomb[i].boundary=&AlienBound;
    Sprites[i]=&Bomb[i];
    i++;
  }
  while (i<40)
  {
    Alien[i-8].icon.wt=16;
    Alien[i-8].icon.ht=16;
    if (i & 1)
    {
      Alien[i-8].icon.icondata=*Alien2Icon;
    }
    else
    {
      Alien[i-8].icon.icondata=*Alien1Icon;
    }
    Alien[i-8].x=(i & 7)*25+10;
    Alien[i-8].y=(i>>3)*20+30;
    Alien[i-8].visible=1;
    Alien[i-8].collision=0;
    Alien[i-8].boundary=&AlienBound;
    Sprites[i]=&Alien[i-8];
    i++;
  }
  /* Setup shot sprites */
  while (i<44)
  {
    Shot[i-40].icon.wt=3;
    Shot[i-40].icon.ht=8;
    Shot[i-40].icon.icondata=*ShotIcon;
    Shot[i-40].x=0;
    Shot[i-40].y=0;
    Shot[i-40].visible=0;
    Shot[i-40].collision=0;
    Shot[i-40].boundary=&AlienBound;
    Sprites[i]=&Shot[i-40];
    i++;
  }
  /* Setup shooter sprite */
  Shooter.icon.wt=20;
  Shooter.icon.ht=16;
  Shooter.icon.icondata=*ShooterIcon;
  Shooter.x=10;
  Shooter.y=SCREEN_HEIGHT-10-16;
  Shooter.visible=1;
  Shooter.collision=0;
  Shooter.boundary=&AlienBound;
  Sprites[i]=&Shooter;
  i++;
  /* Setup cursor */
  SetCursor(0);
  MoveCursor(240,125);
  ShowCursor(1);
  Sprites[i]=&Cursor;
  /* Draw spare shooters */
  Shooters=3;
  i=0;
  while (i<3)
  {
    DrawIcon(i*25+10,10,&Shooter.icon,1);
    i++;
  }
  /* Setup shield icon */
  Shield.wt=36;
  Shield.ht=16;
  Shield.icondata=*ShieldIcon;
  /* Draw shields */
  i=0;
  while (i<4)
  {
    DrawIcon(i*125+40,SHIELD_TOP,&Shield,1);
    i++;
  }
}

void GameLoop(void)
{
  int16_t dir,i,j,fc,coll;
  volatile int16_t sdir,slen,Points;
  volatile uint32_t rnd;

  dir=2;
  sdir=3;
  slen=20;
  Points=0;
  DrawDec(420,3,Points,1);
  while (!GameOver)
  {
    /* Syncronize with frame count */
    if (FrameCount!=fc)
    {
      if (FrameCount>=25)
      {
        FrameCount=0;
        STM_EVAL_LEDToggle(LED3);
        rnd=Random(0xFF);
        DrawHex(0,0,rnd,1);
      }
      fc=FrameCount;
      /* Check shot boundary and collision */
      i=0;
      while (i<4)
      {
        coll=Shot[i].collision;
        if (coll & COLL_TOP)
        {
          Shot[i].visible=0;
          Shots--;
        }
        else if (coll & COLL_SPRITE)
        {
          /* Collision with a sprite */
          Shot[i].visible=0;
          Shots--;
          /* Find what the shot collided with */
          j=0;
          while (j<32)
          {
            if (Alien[j].visible)
            {
              if (Shot[i].x+3>=Alien[j].x && Shot[i].x<Alien[j].x+16)
              {
                if (Alien[j].y+16>Shot[i].y && Alien[j].y<=Shot[i].y)
                {
                  Alien[j].visible=0;
                  Points+=5;
                  DrawDec(420,3,Points,1);
                  break;
                }
              }
            }
            j++;
          }
        }
        else if (coll & COLL_BACKGROUND)
        {
          /* Collision with a shield */
          Shot[i].visible=0;
          Shots--;
          /* Make some damage to the shield */
          SetPixel(Shot[i].x-3,Shot[i].y,0);
          SetPixel(Shot[i].x-2,Shot[i].y,0);
          SetPixel(Shot[i].x-1,Shot[i].y,0);
          SetPixel(Shot[i].x,Shot[i].y,0);
          SetPixel(Shot[i].x+1,Shot[i].y,0);
          SetPixel(Shot[i].x+2,Shot[i].y,0);
          SetPixel(Shot[i].x+3,Shot[i].y,0);

          SetPixel(Shot[i].x-2,Shot[i].y-1,0);
          SetPixel(Shot[i].x-1,Shot[i].y-1,0);
          SetPixel(Shot[i].x,Shot[i].y-1,0);
          SetPixel(Shot[i].x+1,Shot[i].y-1,0);
          SetPixel(Shot[i].x+2,Shot[i].y-1,0);

          SetPixel(Shot[i].x-1,Shot[i].y-2,0);
          SetPixel(Shot[i].x,Shot[i].y-2,0);
          SetPixel(Shot[i].x+1,Shot[i].y-2,0);

          SetPixel(Shot[i].x,Shot[i].y-3,0);
        }
        Shot[i].y-=2;
        i++;
      }
      /* Check bomb boundary and collision */
      i=0;
      while (i<8)
      {
        coll=Bomb[i].collision;
        if (coll & COLL_BOTTOM)
        {
          Bomb[i].visible=0;
          Bombs--;
        }
        else if (coll & COLL_BACKGROUND)
        {
          /* Collision with a shield */
          Bomb[i].visible=0;
          Bombs--;
          /* Make some damage to the shield */
          SetPixel(Bomb[i].x-3,Bomb[i].y+6,0);
          SetPixel(Bomb[i].x-2,Bomb[i].y+6,0);
          SetPixel(Bomb[i].x-1,Bomb[i].y+6,0);
          SetPixel(Bomb[i].x,Bomb[i].y+6,0);
          SetPixel(Bomb[i].x+1,Bomb[i].y+6,0);
          SetPixel(Bomb[i].x+2,Bomb[i].y+6,0);
          SetPixel(Bomb[i].x+3,Bomb[i].y+6,0);

          SetPixel(Bomb[i].x-3,Bomb[i].y+7,0);
          SetPixel(Bomb[i].x-2,Bomb[i].y+7,0);
          SetPixel(Bomb[i].x-1,Bomb[i].y+7,0);
          SetPixel(Bomb[i].x,Bomb[i].y+7,0);
          SetPixel(Bomb[i].x+1,Bomb[i].y+7,0);
          SetPixel(Bomb[i].x+2,Bomb[i].y+7,0);
          SetPixel(Bomb[i].x+3,Bomb[i].y+7,0);

          SetPixel(Bomb[i].x-2,Bomb[i].y+8,0);
          SetPixel(Bomb[i].x-1,Bomb[i].y+8,0);
          SetPixel(Bomb[i].x,Bomb[i].y+8,0);
          SetPixel(Bomb[i].x+1,Bomb[i].y+8,0);
          SetPixel(Bomb[i].x+2,Bomb[i].y+8,0);

          SetPixel(Bomb[i].x-1,Bomb[i].y+9,0);
          SetPixel(Bomb[i].x,Bomb[i].y+9,0);
          SetPixel(Bomb[i].x+1,Bomb[i].y+9,0);

          SetPixel(Bomb[i].x,Bomb[i].y+10,0);
        }
        Bomb[i].y+=2;
        i++;
      }
      /* Drop a bomb */
      if (Bombs<8)
      {
        rnd=Random(31);
        while (!Alien[rnd].visible)
        {
          rnd++;
          rnd&=31;
        }
        /* Find what bomb sprite to use */
        i=0;
        while (i<8)
        {
          if (!Bomb[i].visible)
          {
            Bomb[i].visible=1;
            Bomb[i].x=Alien[rnd].x+8;
            Bomb[i].y=Alien[rnd].y+16;
            Bombs++;
            break;
          }
          i++;
        }
      }
      /* Check if shooter hit */
      if (Shooter.collision & COLL_SPRITE)
      {
        /* Find bomb(s) */
        i=0;
        while (i<8)
        {
          if (Bomb[i].y+8>220)
          {
            if (Bomb[i].x>=Shooter.x && Bomb[i].x<Shooter.x+20)
            {
              Bomb[i].visible=0;
            }
          }
          i++;
        }
        Shooters--;
        if (Shooters<0)
        {
          Shooter.visible=0;
          GameOver=1;
        }
        else
        {
          /* Remove spare shooter */
          DrawIcon(Shooters*25+10,10,&Shooter.icon,0);
        }
        Shooter.x=10;
        sdir=3;
        slen=10;
      }
      /* Move shooter */
      if (slen)
      {
        if ((sdir>0 && (Shooter.collision & COLL_RIGHT)) || (sdir<0 && (Shooter.collision & COLL_LEFT)))
        {
          sdir=-sdir;
        }
        Shooter.x+=sdir;
        slen--;
      }
      else
      {
        i=Random(100);
        if (i<5)
        {
          slen=Random(40);
          i=Random(9);
          if (i<5)
          {
            sdir=-3;
          }
          else
          {
            sdir=3;
          }
        }
      }
      /* Shoot */
      if (Shots<4)
      {
        i=Random(100);
        if (i<5)
        {
          i=0;
          while(i<4)
          {
            if (!Shot[i].visible)
            {
              Shot[i].x=Shooter.x+10;
              Shot[i].y=216;
              Shot[i].visible=1;
              Shots++;
              break;
            }
            i++;
          }
        }
      }
      /* Check alien boundaries, there is no need to check collision */
      i=0;
      coll=0;
      while (i<32)
      {
        coll|=Alien[i].collision;
        i++;
      }
      if (!(coll & COLL_BOTTOM))
      {
        if ((dir>0 && (coll & COLL_RIGHT)) || (dir<0 && (coll & COLL_LEFT)))
        {
          /* Move aliens down and change direction */
          i=0;
          while (i<32)
          {
            Alien[i].y+=4;
            i++;
          }
          dir=-dir;
        }
        else
        {
          i=0;
          while (i<32)
          {
            if (!FrameCount)
            {
              /* Change alien icon */
              if (Alien[i].icon.icondata==*Alien1Icon)
              {
                Alien[i].icon.icondata=*Alien2Icon;
              }
              else
              {
                Alien[i].icon.icondata=*Alien1Icon;
              }
            }
            /* Move alien left or right */
            Alien[i].x+=dir;
            i++;
          }
        }
      }
      else
      {
        GameOver=1;
      }
    }
  }
  /* Remove shots */
  i=0;
  while (i<4)
  {
    Shot[i].visible=0;
    i++;
  }
  /* Remove bombs */
  i=0;
  while (i<8)
  {
    Bomb[i].visible=0;
    i++;
  }
  DrawLargeString(168,115,"Game Over\0",1);
  FrameCount=0;
  while (FrameCount<1000);
}

/**
  * @brief  Main program
  * @param  None
  * @retval None
  */
void main(void)
{
  RCC_Config();
  NVIC_Config();
  GPIO_Config();
  TIM_Config();
  SPI_Config();
  DMA_Config();
  USART_Config(115200);
  /* Enable TIM3 */
  TIM_Cmd(TIM3, ENABLE);
  STM_EVAL_LEDInit(LED3);

  while (1)
  {
    GameSetup();
    GameLoop();
  }
}

/**
  * @brief  Configure peripheral clocks
  * @param  None
  * @retval None
  */
void RCC_Config(void)
{
  /* Enable DMA1, GPIOA, GPIOB clocks */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_DMA1 | RCC_AHB1Periph_GPIOA | RCC_AHB1Periph_GPIOB, ENABLE);
  /* Enable USART2, TIM3, TIM4, TIM5 and SPI2 clocks */
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2 | RCC_APB1Periph_TIM3 | RCC_APB1Periph_TIM4 | RCC_APB1Periph_TIM5 | RCC_APB1Periph_SPI2, ENABLE);
}

/**
  * @brief  Configure interrupts
  * @param  None
  * @retval None
  */
void NVIC_Config(void)
{
  NVIC_InitTypeDef NVIC_InitStructure;

  NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
  /* Enable the TIM3 gloabal Interrupt */
  NVIC_InitStructure.NVIC_IRQChannel = TIM3_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
  /* Enable the TIM4 gloabal Interrupt */
  NVIC_InitStructure.NVIC_IRQChannel = TIM4_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
  /* Enable the TIM5 gloabal Interrupt */
  NVIC_InitStructure.NVIC_IRQChannel = TIM5_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 3;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
	/* Enable USART interrupt */
	NVIC_InitStructure.NVIC_IRQChannel = USART2_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
  /* Enable and set EXTI Line0 Interrupt to the lowest priority */
  NVIC_InitStructure.NVIC_IRQChannel = EXTI0_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
  /* Enable and set EXTI Line2 Interrupt to the lowest priority */
  NVIC_InitStructure.NVIC_IRQChannel = EXTI2_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
}

/**
  * @brief  Configure GPIO
  * @param  None
  * @retval None
  */
void GPIO_Config(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;
  EXTI_InitTypeDef EXTI_InitStructure;

  /* Configure PA1 as output, H-Sync and V-Sync*/
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_NOPULL ;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  /* H-Sync and V-Sync signal High */
  GPIO_SetBits(GPIOA,GPIO_Pin_1);

  /* SPI MOSI and SPI SCK pin configuration */
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd  = GPIO_PuPd_UP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_15 | GPIO_Pin_13;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
  /* Connect SPI2 pins */  
  GPIO_PinAFConfig(GPIOB, GPIO_PinSource13, GPIO_AF_SPI2);
  GPIO_PinAFConfig(GPIOB, GPIO_PinSource15, GPIO_AF_SPI2);

  /* USART Tx and Rx pin configuration */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2 | GPIO_Pin_3;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  /* Connect USART2 pins */  
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource2, GPIO_AF_USART2);
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource3, GPIO_AF_USART2);

  /* GPIOB Pin3, Pin2, Pin1 and Pin0 as input floating */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3 | GPIO_Pin_2 | GPIO_Pin_1 | GPIO_Pin_0;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
  GPIO_Init(GPIOB, &GPIO_InitStructure);

  /* Connect EXTI Line0 to PB0 pin */
  SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOB, EXTI_PinSource0);
  /* Configure EXTI Line0 */
  EXTI_InitStructure.EXTI_Line = EXTI_Line0;
  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;  
  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
  EXTI_Init(&EXTI_InitStructure);

  /* Connect EXTI Line2 to PB2 pin */
  SYSCFG_EXTILineConfig(EXTI_PortSourceGPIOB, EXTI_PinSource2);
  /* Configure EXTI Line2 */
  EXTI_InitStructure.EXTI_Line = EXTI_Line2;
  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;  
  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
  EXTI_Init(&EXTI_InitStructure);
}

/**
  * @brief  Configure timers
  * @param  None
  * @retval None
  */
void TIM_Config(void)
{
  TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;

  /* Time base configuration */
  TIM_TimeBaseStructure.TIM_Period = 84*64-1;                     // 64uS
  TIM_TimeBaseStructure.TIM_Prescaler = 0;
  TIM_TimeBaseStructure.TIM_ClockDivision = 0;
  TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
  TIM_TimeBaseInit(TIM3, &TIM_TimeBaseStructure);
  /* Enable TIM3 Update interrupt */
  TIM_ClearITPendingBit(TIM4,TIM_IT_Update);
  TIM_ITConfig(TIM3, TIM_IT_Update, ENABLE);
  /* Time base configuration */
  TIM_TimeBaseStructure.TIM_Period = (84*H_SYNC)/1000;            // 4,70uS
  TIM_TimeBaseStructure.TIM_Prescaler = 0;
  TIM_TimeBaseStructure.TIM_ClockDivision = 0;
  TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
  TIM_TimeBaseInit(TIM4, &TIM_TimeBaseStructure);
  /* Enable TIM4 Update interrupt */
  TIM_ClearITPendingBit(TIM4,TIM_IT_Update);
  TIM_ITConfig(TIM4, TIM_IT_Update, ENABLE);
  /* Time base configuration */
  TIM_TimeBaseStructure.TIM_Period = 32;
  TIM_TimeBaseStructure.TIM_Prescaler = 0;
  TIM_TimeBaseStructure.TIM_ClockDivision = 0;
  TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
  TIM_TimeBaseInit(TIM5, &TIM_TimeBaseStructure);
  /* Enable TIM5 Update interrupt */
  TIM_ClearITPendingBit(TIM5,TIM_IT_Update);
  TIM_ITConfig(TIM5, TIM_IT_Update, ENABLE);
}

/**
  * @brief  Configures SPI2 to output pixel data
  * @param  None
  * @retval None
  */
void SPI_Config(void)
{
  SPI_InitTypeDef SPI_InitStructure;

